app/Helpers/custom_helper.php

function adminLogin () {
    $db = \Config\Database::connect();
    return $db->table('admin')->where('id_admin', session('id_admin'))->get()->getRow();
---
SELECT *
FROM `admin`
WHERE `id_admin` = '17'