app/Models/CartModel.php

SELECT *
FROM `cart`
JOIN `customers` ON `customers`.`id_customer` = `cart`.`id_customer`
JOIN `products` ON `products`.`id_product` = `cart`.`id_product`
WHERE `cart`.`deleted_at` IS NULL
---
    function getAll()
    {
        $builder = $this->db->table('cart');
        $builder->join('customers', 'customers.id_customer = cart.id_customer');
        $builder->join('products', 'products.id_product = cart.id_product');
        $builder->where('cart.deleted_at', null);
        $query = $builder->get();