app/Models/ProductsModel.php

    function getAll() {
        $builder = $this->db->table('products');
        $builder->join('category', 'category.id_category = products.id_category');
        $builder->where('products.deleted_at', null); // Filter data yang belum dihapus secara logis
        $query = $builder->get();
---
SELECT *
FROM `products`
JOIN `category` ON `category`.`id_category` = `products`.`id_category`
WHERE `products`.`deleted_at` IS NULL